---
kind: type
id: T:Autodesk.Revit.UI.ExternalApplicationArray
source: html/5388ad7c-8963-37c7-e021-d0155edccb7a.htm
---
# Autodesk.Revit.UI.ExternalApplicationArray

An array that can contain any number of IExternalApplication objects.

## Syntax (C#)
```csharp
public class ExternalApplicationArray : APIObject,
	IEnumerable
```